app/views/tickets/_activities_grid.html.erb

SELECT `employees`.* FROM `employees`
---

  g.column  name:  'Empleado', attribute: 'name', assoc: :employee