app/controllers/activities_controller.rb

  def create
    @activity = Activity.new(activity_params)

    if @activity.save
---
INSERT INTO `activities` (`description`, `user_id`, `ticket_id`, `date`, `created_at`, `updated_at`) VALUES ('prueba de usuario', 1, 1, '2016-05-04 05:18:00', '2016-05-04 05:19:12', '2016-05-04 05:19:12')

  def update
    if @activity.update(activity_params)
---
UPDATE `activities` SET `description` = 'asdasdZXZXZX', `updated_at` = '2016-04-22 00:17:12' WHERE `activities`.`id` = 1

    def set_activity
      @activity = Activity.find(params[:id])
---
SELECT  `activities`.* FROM `activities` WHERE `activities`.`id` = 1 LIMIT 1