app/controllers/customers_controller.rb

  def create
    @customer = Customer.new(customer_params)

    if @customer.save
---
INSERT INTO `customers` (`name`, `adress`, `phone`, `contact`, `rfc`, `email`, `ip`, `server`, `datacenter`, `vpacesetter`, `vprogress`, `userNumber`, `catalog`, `softwareC`, `programesp`, `emailpdf`, `emailxml`, `pdf`, `created_at`, `updated_at`) VALUES ('Del Sol', 'Dir', 'phone', 'Contacto', 'rfc', 'email', 'ip', 'serv', 1, 'dd', 'f', 2, 's', 's', 's', 's', 's', 1, '2016-04-20 17:03:35', '2016-04-20 17:03:35')

  def update
    if @customer.update(customer_params)
---
UPDATE `customers` SET `adress` = 'DirasdasdASDASDASDfdsdhhhhhhhhhhhhhh', `updated_at` = '2016-04-28 18:07:01' WHERE `customers`.`id` = 1

    def set_customer
      @customer = Customer.find(params[:id])
---
SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1