app/controllers/employees_controller.rb

INSERT INTO `employees` (`name`, `email`, `phone`, `created_at`, `updated_at`) VALUES ('Alberto', 'alberto@bluesage.com', '6641231212', '2016-04-21 05:19:26', '2016-04-21 05:19:26')
---
  def create
    @employee = Employee.new(employee_params)

    if @employee.save

SELECT  `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1
---
    def set_employee
      @employee = Employee.find(params[:id])