app/controllers/priorities_controller.rb

INSERT INTO `priorities` (`name`, `description`, `created_at`, `updated_at`) VALUES ('Alta', 's/d', '2016-04-21 05:22:02', '2016-04-21 05:22:02')
---
  def create
    @priority = Priority.new(priority_params)

    if @priority.save

SELECT  `priorities`.* FROM `priorities` WHERE `priorities`.`id` = 1 LIMIT 1
---
    def set_priority
      @priority = Priority.find(params[:id])