app/controllers/situations_controller.rb

INSERT INTO `situations` (`name`, `description`, `created_at`, `updated_at`) VALUES ('recibido', 's/d', '2016-04-21 05:21:44', '2016-04-21 05:21:44')
---
  def create
    @situation = Situation.new(situation_params)

    if @situation.save

SELECT  `situations`.* FROM `situations` WHERE `situations`.`id` = 1 LIMIT 1
---
    def set_situation
      @situation = Situation.find(params[:id])