app/controllers/tickets_controller.rb

INSERT INTO `tickets` (`contactName`, `notes`, `employee_id`, `customer_id`, `priority_id`, `situation_id`, `category_id`, `user_id`, `date`, `created_at`, `updated_at`) VALUES ('wewqeqw', 'dfggfdgfdgfd', 1, 1, 1, 1, 1, 0, '2016-04-30 02:39:00', '2016-04-30 02:39:32', '2016-04-30 02:39:32')
---
  def create
    @ticket = Ticket.new(ticket_params)

    if @ticket.save

UPDATE `tickets` SET `contactName` = 'Hope', `updated_at` = '2016-04-21 23:44:25' WHERE `tickets`.`id` = 1
---
  def update
    if @ticket.update(ticket_params)

SELECT  `tickets`.* FROM `tickets` WHERE `tickets`.`id` = 1 LIMIT 1
---
    def set_ticket
      @ticket = Ticket.find(params[:id])